Repository: andrecini/TesteOmegaT
Catalog: testeomegat-level1.tmx
Source language: pt_br
Languages: es

source: Repare que de uma instrução simples parte apenas uma seta (aresta) enquanto de uma instrução de decisão partem duas.
es: Note that from a simple statement there is only one arrow (edge) while from a decision statement there are two.

source: Repare que ele indica com um “+1” os pontos que se enquadram em uma das condições de incremento apresentadas anteriormente na fórmula de cálculo.
es: Note that it indicates with a "+1" the points that fall under one of the increment conditions presented previously in the calculation formula.

source: Repare que o grafo também se altera.
es: Notice that the graph also changes.

source: Repare que o último caminho não passa em nenhuma instrução nova pela qual já não tenha sido passada antes em um dos três caminhos anteriores.
es: Note that the last path does not pass any new instructions that have not been passed before in one of the previous three paths.

source: Repare que o último “return” não conta.
es: Note that the last “return” does not count.

source: Se colocarmos mais um “IF” neste algoritmo veremos que o número de caminhos possíveis vai saltar para 8 numa progressão exponencial.
es: If we put one more “IF” in this algorithm we will see that the number of possible paths will jump to 8 in an exponential progression.

source: Seguindo este raciocínio, o cálculo pode ser expandido para programas com mais de uma saída adicionando um ponto extra para cada saída.
es: Following this reasoning, the calculation can be expanded to programs with more than one output by adding an extra point for each output.

source: São necessários outros dois cenários de teste para que 100% das linhas consigam ser cobertas conforme pode ser vista na Figura 15.
es: Two other test scenarios are needed so that 100% of the lines can be covered as can be seen in Figure 15.

source: Temos oito combinações possíveis destes parâmetros gerando oito opções de compra do sorvete como pode ser visto na Figura 5.
es: We have eight possible combinations of these parameters, generating eight options for purchasing the ice cream as can be seen in Figure 5.

source: Uma forma de obter uma cobertura de testes de 100% seria fazer um caso de teste para cada caminho como mostra o código a seguir:
es: One way to get 100% test coverage would be to make a test case for each path as shown in the following code:

source: Uma vez que se conheça a forma de cálculo baseado em palavras reservadas é possível calcular complexidade ciclomática em várias linguagens da mesma forma, basta identificar as palavras reservadas que representam uma decisão ou saída precoce do programa.
es: Once the form of calculation based on reserved words is known, it is possible to calculate cyclomaticcomplexity in several languages ​​in the same way, just identify the reserved words that represent a decision or early exit from the program.

source: Veja, graficamente, a complexidade ciclomática 4:
es: See, graphically, the cyclomatic 4 complexity:

source: assertEquals(17, sorveteria.precoSorvete(false, false, 1)); // Comum-Copinho-1Cob
es: assertEquals (17, sorbeteria.precoSorvete (false, false, 1)); // Common-Cup-1Cob

source: assertEquals(18, sorveteria.precoSorvete(false, true, 1)); // Comum-Casquinha-1Cob
es: assertEquals (18, sorbeteria.precoSorvete>(false, true, 1)); // Common-Cup-1Cob

source: assertEquals(19, sorveteria.precoSorvete(false, true, 2)); // Comum-Casquinha-2Cob
es: assertEquals (19, sorbeteria.precoSorvete>(false, true, 2)); // Common-Cup-2Co

source: assertEquals(22, sorveteria.precoSorvete(true, false, 1)); // Premium-Copinho-1Cob
es: assertEquals (22, sorbeteria.precoSorvete>(true, false, 1)); // Common-Cup-1Co

source: assertEquals(23, sorveteria.precoSorvete(true, true, 1)); // Premium-Casquinha-1Cob
es: assertEquals (23, sorbeteria.precoSorvete>(true, true, 1)); // Common-Cup-1Co

source: assertEquals(23, sorveteria.precoSorvete(true, false, 2)); // Premium-Copinho-2Cob
es: assertEquals (23, sorbeteria.precoSorvete>(true, false, 2)); // Common-Cup-2Co

source: assertEquals(24, sorveteria.precoSorvete(true, true, 2)); // Premium-Casquinha-2Cob
es: assertEquals (24, sorbeteria.precoSorvete>(true, true, 2)); // Common-Cup-2Co

source: public int precoSorvete(boolean premium, boolean casquinha, int coberturas) {
es: public int priceIce cream (boolean premium, boolean cone, int coverings) {

source: É realmente bem mais simples aplicar a fórmula “π – s + 2” e contar as palavras reservadas que representam uma decisão no código junto com os pontos de saída antecipada do programa.
es: It is actually much simpler to apply the formula “π - s + 2” and count the reserved words that represent a decision in the code together with the program's early exit points.
